<a href="https://colab.research.google.com/github/Balgaros/Python/blob/master/Evaluation_Yvan_Capron.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
"Jeu de donnée à exploiter"
import pandas as pd
import seaborn as sns
import matplotlib as plt
import numpy as np

from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [37]:
df = pd.read_csv('/content/drive/My Drive/data.csv')
df.info

<bound method DataFrame.info of                  Country  ...             WHO Region
0            Afghanistan  ...  Eastern Mediterranean
1            Afghanistan  ...  Eastern Mediterranean
2            Afghanistan  ...  Eastern Mediterranean
3            Afghanistan  ...  Eastern Mediterranean
4            Afghanistan  ...  Eastern Mediterranean
...                  ...  ...                    ...
2487  Russian Federation  ...                 Europe
2488  Russian Federation  ...                 Europe
2489              Sweden  ...                 Europe
2490         Switzerland  ...                 Europe
2491            Cambodia  ...        Western Pacific

[2492 rows x 6 columns]>

In [34]:
"Analyser jeu de donnée"
df.head(5)

       Country  Year  ... Cholera case fatality rate             WHO Region
0  Afghanistan  2016  ...                        0.7  Eastern Mediterranean
1  Afghanistan  2015  ...                       0.01  Eastern Mediterranean
2  Afghanistan  2014  ...                        0.0  Eastern Mediterranean
3  Afghanistan  2013  ...                       0.35  Eastern Mediterranean
4  Afghanistan  2012  ...                        0.1  Eastern Mediterranean

[5 rows x 6 columns]

In [36]:
df.dtypes

Country                                   object
Year                                       int64
Number of reported cases of cholera       object
Number of reported deaths from cholera    object
Cholera case fatality rate                object
WHO Region                                object
dtype: object

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2492 entries, 0 to 2491
Data columns (total 6 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Country                                 2492 non-null   object
 1   Year                                    2492 non-null   int64
 2   Number of reported cases of cholera     2470 non-null   object
 3   Number of reported deaths from cholera  2375 non-null   object
 4   Cholera case fatality rate              2365 non-null   object
 5   WHO Region                              2492 non-null   object
dtypes: int64(1), object(5)
memory usage: 116.9+ KB

In [38]:
df.describe(include='all')

       Country         Year  ... Cholera case fatality rate WHO Region
count     2492  2492.000000  ...                       2365       2492
unique     162          NaN  ...                        846          6
top      India          NaN  ...                          0     Africa
freq        64          NaN  ...                        733        991
mean       NaN  1992.343098  ...                        NaN        NaN
std        NaN    14.834151  ...                        NaN        NaN
min        NaN  1949.000000  ...                        NaN        NaN
25%        NaN  1981.000000  ...                        NaN        NaN
50%        NaN  1994.000000  ...                        NaN        NaN
75%        NaN  2004.000000  ...                        NaN        NaN
max        NaN  2016.000000  ...                        NaN        NaN

[11 rows x 6 columns]

In [35]:
"Traiter les NAN ici avec des 2"
df.dropna()
df.fillna(2)

                 Country  ...             WHO Region
0            Afghanistan  ...  Eastern Mediterranean
1            Afghanistan  ...  Eastern Mediterranean
2            Afghanistan  ...  Eastern Mediterranean
3            Afghanistan  ...  Eastern Mediterranean
4            Afghanistan  ...  Eastern Mediterranean
...                  ...  ...                    ...
2487  Russian Federation  ...                 Europe
2488  Russian Federation  ...                 Europe
2489              Sweden  ...                 Europe
2490         Switzerland  ...                 Europe
2491            Cambodia  ...        Western Pacific

[2492 rows x 6 columns]

In [ ]:
print(df['Year'])